install.packages("expm") #пакет для более удобного возведения матрицы в степень
library(expm)

#матрица вероятностей без учета вер-ти задержаться
P <- matrix(c(0, 0, 0.15, 0, 0, 0.77, rep(0, 8), 0.42, 0, 0.51, 
              rep(0, 12), 0.52, 0, 0.42, rep(0, 11), 0.11, 0, 0, 
              0.34, rep(0, 9), 0.18, 0.18, 0, 0.25, 0, 0, 0, 0.31,
              rep(0, 10), 0.54, 0, 0, 0, 0.32, rep(0, 5), 0.65, 0.14,
              rep(0, 5), 0.11, rep(0, 8), 0.06, rep(0, 3), 0.16, 0, 0, 
              0.26, 0, 0.29, 0.2, rep(0, 5), 0.07, 0, 0.19, 0.14, 0, 
              0.11, 0, 0.23, 0, 0.24, rep(0, 7), 0.87, rep(0, 13), 0.23,
              0.45, 0, 0, 0.25, rep(0, 12), 0.42, rep(0, 10), 0.17, 0.35,
              0, 0, 0, 0, 0.16, rep(0, 7), 0.02, 0.55, 0, 0, 0, 0.36, 0), 
            nrow = 14, ncol = 14, byrow = TRUE)

#заполнение диагонали матрицы 

for (i in 1:ncol(P))
  P[i,i] <- 1 - sum(P[i,])
P 

#4) вероятность перехода из состояния 6 
#в состояние 8 не позднее чем за 10 шагов

P4 <- P
f_p4 <- function(p, k) #нахожд. матрицы вер-тей первых переходов
{
  temp_p <- p
  rez <- p
  summ <- p
  for (t in 1:k) #не поздее чем за 10 шагов
  {
    for (i in 1:ncol(p))
    {
      for (j in 1:ncol(p))
      {
        rez[i,j] <- 0
        for (m in 1:ncol(p))
          if (m!=j) #пропуск перехода в состояние на первых шагах
            rez[i,j] <- rez[i,j] + p[i,m] * temp_p[m][j]
      }
    }
    for (r in 1:ncol(rez))
    {
      for (d in 1:ncol(rez))
        summ[r,d] <- summ[r,d] + rez[r,d]
    }
    temp_p <- rez
  }
  return(summ) 
}


f_p4(P,10)  
f_p4[6, 8]